---------------------------------------------------------------------
--reborn.重生|投胎 脚本
--countryu取自Natsume(https://forum.kokona.tech/d/118)
--作者:简律纯(qq:A2C29K9)
--2022.06.24 Fixed
---------------------------------------------------------------------
    local countryu = { "芬兰","瑞典","挪威","冰岛","丹麦","法罗群岛（丹）" ,"爱沙尼亚","拉脱维亚","立陶宛","俄罗斯","白俄罗斯","乌克兰","摩尔多瓦","波兰","捷克","斯洛伐克","匈牙利","德国","奥地利","瑞士","列支敦士登","英国","爱尔兰","荷兰","比利时","卢森堡","法国","摩纳哥","罗马尼亚","保加利亚","塞尔维亚","黑山","马其顿","阿尔巴尼亚","希腊","斯洛文尼亚","克罗地亚","波斯尼亚和墨塞哥维那","意大利","梵蒂冈","圣马力诺","马耳他","西班牙","葡萄牙","安道尔","中国","蒙古","朝鲜","韩国","日本","菲律宾","越南","老挝","柬埔寨","缅甸","泰国","马来西亚","文莱","新加坡","印度尼西亚","东帝汶","尼泊尔","不丹","孟加拉国","印度","巴基斯坦","斯里兰卡","马尔代夫","哈萨克斯坦","土库曼斯坦","塔吉克斯坦","乌兹别克斯坦","吉尔吉斯斯坦","阿富汗","伊拉克","伊朗","叙利亚","约旦","黎巴嫩","以色列","巴勒斯坦","巴林","卡塔尔","科威特","沙特阿拉伯","阿拉伯联合酋长国","阿曼","也门","格鲁吉亚","亚美尼亚","阿塞拜疆","塞浦路斯","土耳其","埃及","利比亚","苏丹","突尼斯","阿尔及利亚","摩洛哥","亚速尔群岛（葡）","马德拉群岛（葡）","埃塞俄比亚","厄立特里亚","索马里","吉布提","肯尼亚","坦桑尼亚","乌干达","卢旺达","布隆迪","塞舌尔","赞比亚","安哥拉","津巴布韦","马拉维","莫桑比克","博茨瓦纳","纳米比亚","斯威士兰","莱索托","马达加斯加","科摩罗","毛里求斯","留尼旺（法）","圣赫勒拿","（英）南非","乍得","中非","喀麦隆","加蓬","圣多美","赤道几内亚","刚果民主共和国（刚果)","普林西比","毛里塔尼亚","塞内加尔","冈比亚","马里","布基纳法索","几内亚","几内亚比绍","塞拉利昂","利比里亚","科特迪瓦","佛得角","加纳","多哥","贝宁","尼日尔","加那利群岛（西）","澳大利亚","新西兰","巴布亚新几内亚","所罗门群岛","瓦努阿图","密克罗尼西亚","马绍尔群岛","帕劳","瑙鲁","基里巴斯","图瓦卢","萨摩亚","斐济群岛","汤加","库克群岛（新）","关岛（美）","新喀里多尼亚（法）","法属波利尼西亚","皮特凯恩岛（英）","瓦利斯与富图纳（法）","纽埃（新）","托克劳（新）","美属萨摩亚","北马里亚纳（美）","加拿大","美国","墨西哥","格陵兰（丹）","危地马拉","伯利兹","萨尔瓦多","洪都拉斯","尼加拉瓜","哥斯达黎加","巴拿马","巴哈马","古巴","牙买加","海地","多米尼加共和国","安提瓜和巴布达","圣基茨和尼维斯","多米尼克","圣卢西亚","圣文森特和格林纳丁斯","格林纳达","特立尼达和多巴哥","波多黎各（美）","英属维尔京群岛","巴巴多斯","美属维尔京群岛","蒙特塞拉特（英）","瓜德罗普（法）","马提尼克（法）","荷属安的列斯","安圭拉","阿鲁巴（荷）","特克斯和凯科斯群岛（英）","开曼群岛（英）","百慕大（英）","哥伦比亚","委内瑞拉","圭亚那","法属圭亚那","苏里南","厄瓜多尔","秘鲁","玻利维亚","巴西","智利","阿根廷","乌拉圭","巴拉圭"}
    -- 国家
    
local cardu = {
    "你患有败血症\n",
    "你发育不良\n",
    "你得了新冠病毒\n",
    "你居然没有屁眼\n",
    "你喜欢和小狗抢食物\n",
    "你看得见空气中浮动的黑色粒子\n" .. "你有两个脑袋\n",
    "你喜欢咬脚趾甲\n",
    "你喜欢吃墙灰\n",
    "你患有糖尿病\n",
    "你的小心脏是露出来的\n",
    "你是畸形儿\n",
    "你看上去像个傻子\n",
    "你长得很丑\n"
}
-- 病情描述，可增加

local apper = {"你有着大大的眼睛\n", "你的睫毛很长很好看\n", "你总是很好奇的看着世界\n", "你五官端正\n", "你出生时没有大哭大闹\n", "你长得很可爱\n", "你看上去很乖巧\n"}
-- 健康描述，可增加

local parent_good_tab = {"很穷，因此", "看你很可爱于是"}
local parent_bad_tab = {"认为你长得太丑于是", "对你议论纷纷，不过他们", "发现你大有问题便把你扔了，但还是"}
-- 父母行为

local sexu = ranint(1, 100)
--男女比例与下文53对应

local health = ranint(1, 2)
--健康与否

if (sexu <= 53) then
    sex = "男孩子"
elseif (sexu == 1) then
    sex = "雌雄同体"
else
    sex = "女孩子"
end
-- 没有采用drawDeck(0,msg.fromQQ,"性别")的原因是这样可以自定义男女比例

local country = countryu[ranint(1, #countryu)] -- 抽取国家
local card = "" -- 抽选病情
local state = ranint(1, 20) -- 投胎成功概率
local weight = ranint(20, 35) / 10 -- 新生儿体重，折合公斤
local weightu = "" -- 初始化关于体重的评价
local healthu = "" -- 初始化健康与否
local apperu = ""
local parent_good = ""
local parent_bad = ""

if (state == 5) then -- 失败概率为1/20
    dead_weight = ranint(9, 18) / 10
    return "{nick}投胎失败！\n你没能活到出生，祝你下次好运！\n你的父母收到了一具" .. dead_weight .. "公斤的死尸x(没错就是你)"
else
    -- 推起来输出
    -- 投胎失败

    if (weight == 3.2) then
        -- 对体重等于3.2kg的评价
        weightu = "是标准体重哦~"
    elseif (weight <= 2.4) then
        -- 对体重小于2.4kg的评价
        weightu = "有一点点轻呢。"
    elseif (weight > 3.2) then
        weightu = "可能是父母的原因让你有点点小胖吧~"
    -- 对体重大于3.2kg的评价
    end

    if (country == "中国") then
        -- 中国人当然要有中文名
        name = drawDeck(0, msg.fromQQ, "随机姓名_zh") or drawDeck(0, msg.fromQQ, "随机姓名_enzh")
    elseif (country == "日本") then
        -- 霓虹進的名字
        name = drawDeck(0, msg.fromQQ, "随机姓名_jp")
    else
        -- 剩下一律包含en
        name = drawDeck(0, msg.fromQQ, "随机姓名_en") or drawDeck(0, msg.fromQQ, "随机姓名_enzh")
    end

    if (health == 1) then
        healthu, apperu = "你很健康呢！\n", ""
        local start = ranint(1, #apper // 2)
        for i = start, ranint(start + 1, #apper) do
            apperu = apperu .. apper[i]
        end
        -- 健康描述
        parent_good = parent_good_tab[ranint(1, #parent_good_tab)]
    else
        healthu = "你并不是一个健康的孩子:\n"

        local start = ranint(1, #cardu // 2)
        for i = start, ranint(start + 1, #cardu) do
            card = card .. cardu[i]
        end
        -- 病情描述
        parent_bad = parent_bad_tab[ranint(1, #parent_bad_tab)]
    end

    return "{nick}投胎成功！\n你出生在" ..
        country ..
            "，是" ..
                sex ..
                    "\n体重:" ..
                        weight ..
                            "公斤 " ..
                                weightu ..
                                    "\n" ..
                                        healthu ..
                                            apperu .. 
                                                card .. 
                                                    "你的父母" .. 
                                                         parent_good .. 
                                                             parent_bad .. 
                                                                  "给你起名" .. 
                                                                       name
end
